{
  "Algorithms & Data Structures": {
    "code": "Computer Sciences 577",
    "description": "Basic paradigms for the design and analysis of efficient algorithms: greed, divide-and-conquer, dynamic programming, reductions, and the use of randomness. Computational intractability including typical NP-complete problems and ways to deal with them.",
    "tags": ["Computer Science"]
  },
  "Artificial Intelligence": {
    "code": "Computer Sciences 540",
    "description": "Principles of knowledge-based search techniques, automatic deduction, knowledge representation using predicate logic, machine learning, probabilistic reasoning. Applications in tasks such as problem solving, data mining, game playing, natural language understanding, computer vision, speech recognition, and robotics.",
    "tags": ["Computer Science"]
  },
  "Operating Systems": {
    "code": "Computer Sciences 537",
    "description": "Input-output hardware, interrupt handling, properties of magnetic tapes, discs and drums, associative memories and virtual address translation techniques. Batch processing, time sharing and real-time systems, scheduling resource allocation, modular software systems, performance measurement and system evaluation.",
    "tags": ["Computer Science"]
  },
  "The Theory and Design of Programming Languages": {
    "code": "Computer Sciences 538",
    "description": "Design and theory of programming languages: procedural, object-oriented, functional and logic paradigms. Serial and concurrent programming. Execution models and formal specification techniques.",
    "tags": ["Computer Science"]
  },
  "Mathematical Methods in Data Science": {
    "code": "Mathematics 535",
    "description": "A rigorous introduction to mathematical concepts important for modern data science. Topics include: matrix factorizations, optimization theory and algorithms, probabilistic models, finite Markov chains. Mathematical techniques are motivated by and illustrated on a range of applied problems from machine learning and statistics.",
    "tags": ["Computer Science", "Mathematics", "Data Science"]
  },
  "Linear Optimization": {
    "code": "Computer Sciences 525",
    "description": "Introduces optimization problems whose constraints are expressed by linear inequalities. Develops geometric and algebraic insights into the structure of the problem, with an emphasis on formal proofs. Presents the theory behind the simplex method, the main algorithm used to solve linear optimization problems. Explores duality theory and theorems of the alternatives.",
    "tags": ["Computer Science", "Mathematics"]
  },
  "Combinatorial Optimization": {
    "code": "Computer Sciences 425",
    "description": "Focuses on optimization problems over discrete structures, such as shortest paths, spanning trees, flows, matchings, and the traveling salesman problem. We will investigate structural properties of these problems, and we will study both exact methods for their solution, and approximation algorithms.",
    "tags": ["Computer Science", "Mathematics"]
  },
  "Matrix and Linear Algebra": {
    "code": "Mathematics 340",
    "description": "An introduction to linear algebra. Topics include matrix algebra, linear systems of equations, vector spaces, sub-spaces, linear dependence, span, basis, rank of matrices, determinants, linear transformations, coordinate representations, kernel, range, eigenvalues and eigenvectors, diagonalization, inner products and orthogonal vectors, symmetric matrices. Covers linear algebra topics in greater depth and detail than MATH 320. Formal techniques in mathematical argument [MATH 341] not covered.",
    "tags": ["Mathematics"]
  },
  "Probability Theory": {
    "code": "Mathematics 431",
    "description": "Topics covered include axioms of probability, random variables, the most important discrete and continuous probability distributions, expectation and variance, moment generating functions, conditional probability and conditional expectations, multivariate distributions, Markov's and Chebyshev's inequalities, laws of large numbers, and the central limit theorem.",
    "tags": ["Mathematics", "Data Science"]
  },
  "The Theory of Single Variable Calculus": {
    "code": "Mathematics 421",
    "description": "Covers material in first and second semester calculus but it is intended to teach math majors to write and understand proofs in mathematics in general and in calculus in particular.",
    "tags": ["Mathematics"]
  },
  "Multivariate Calculus": {
    "code": "Mathematics 234",
    "description": "Introduction to calculus of functions of several variables; calculus on parameterized curves, derivatives of functions of several variables, multiple integrals, vector calculus.",
    "tags": ["Mathematics"]
  },
  "Machine Organization and Programming": {
    "code": "Computer Sciences 354",
    "description": "An introduction to fundamental structures of computer systems and the C programming language with a focus on the low-level interrelationships and impacts on performance. Topics include the virtual address space and virtual memory, the heap and dynamic memory management, the memory hierarchy and caching, assembly language and the stack, communication and interrupts/signals, compiling and assemblers/linkers.",
    "tags": ["Computer Science"]
  },
  "Computer Engineering": {
    "code": "Computer Sciences 252",
    "description": "Logic components built with transistors, rudimentary Boolean algebra, basic combinational logic design, basic synchronous sequential logic design, basic computer organization and design, introductory machine- and assembly-language programming.",
    "tags": ["Computer Science"]
  },
  "Programming III": {
    "code": "Computer Sciences 400",
    "description": "The third course in our programming fundamentals sequence. It presumes that students understand and use functional and object-oriented design and abstract data types as needed. This course introduces balanced search trees, graphs, graph traversal algorithms, hash tables and sets, and complexity analysis and about classes of problems that require each data type. Students are required to design and implement using high quality professional code, a medium sized program, that demonstrates knowledge and use of latest language features, tools, and conventions. Additional topics introduced will include as needed for projects: inheritance and polymorphism; anonymous inner classes, lambda functions, performance analysis to discover and optimize critical code blocks. Students learn about industry standards for code development. Students will design and implement a medium size project with a more advanced user-interface design, such as a web or mobile application with a GUI and event- driven implementation; use of version-control software.",
    "tags": ["Computer Science", "Data Science"]
  },
  "Programming II": {
    "code": "Computer Sciences 300",
    "description": "Introduction to Object-Oriented Programming using classes and objects to solve more complex problems. Introduces array-based and linked data structures: including lists, stacks, and queues. Programming assignments require writing and developing multi-class (file) programs using interfaces, generics, and exception handling to solve challenging real world problems. Topics reviewed include reading/writing data and objects from/to files and exception handling, and command line arguments. Topics introduced: object-oriented design; class vs. object; create and define interfaces and iterators; searching and sorting; abstract data types (List,Stack,Queue,PriorityQueue(Heap),Binary Search Tree); generic interfaces (parametric polymorphism); how to design and write test methods and classes; array based vs. linked node implementations; introduction to complexity analysis; recursion.",
    "tags": ["Computer Science", "Data Science"]
  },
  "Programming I": {
    "code": "Computer Sciences 200",
    "description": "Learn the process of incrementally developing small (200-500 lines) programs along with the fundamental Computer Science topics. These topics include: problem abstraction and decomposition, the edit-compile-run cycle, using variables of primitive and more complex data types, conditional and loop-based flow control, basic testing and debugging techniques, how to define and call functions (methods), and IO processing techniques. Also teaches and reinforces good programming practices including the use of a consistent style, and meaningful documentation. Intended for students who have no prior programming experience.",
    "tags": ["Computer Science", "Data Science"]
  },
  "Discrete Mathematics": {
    "code": "Computer Sciences 240",
    "description": "Basic concepts of logic, sets, partial order and other relations, and functions. Basic concepts of mathematics (definitions, proofs, sets, functions, and relations) with a focus on discrete structures: integers, bits, strings, trees, and graphs. Propositional logic, Boolean algebra, and predicate logic. Mathematical induction and recursion. Invariants and algorithmic correctness. Recurrences and asymptotic growth analysis. Fundamentals of counting.",
    "tags": ["Computer Science", "Mathematics"]
  },
  "Industrial/Organizational Psychology": {
    "code": "Psychology 601",
    "description": "This course will introduce students to the application of psychological principles to the workplace. Students will see how psychological processes influence the success of individuals, teams, and organizations within a work context. Topics will include psychological assessments at work, statistical test validation and employee selection decisions, legal issues, training and development, performance management, team effectiveness, employee satisfaction, work-life balance, motivation, leadership, and the impact the global pandemic has had on the world of work.",
    "tags": ["Psychology"]
  },
  "Psychology of Personality": {
    "code": "Psychology 403",
    "description": "Organization and development of the personality.",
    "tags": ["Psychology"]
  },
  "The Criminal Mind: Forensic and Psychobiological Perspectives": {
    "code": "Psychology 526",
    "description": "Criminal behavior is an extremely common and costly problem for society. The goal of the course is to provide an indepth understanding of criminal psychology and the relevant forensic and psychobiological processes in the field.",
    "tags": ["Psychology"]
  },
  "Psychology of Human Emotions: From Biology to Culture": {
    "code": "Psychology 508",
    "description": "Emotional experience affects and defines every facet of our life, but it seems mysterious and unsuitable for scientific inquiry. Explore how and why emotion is not unsuited to scientific research and provides an in-depth examination of research from all sub-disciplines of the field of Psychology. This includes neuroscience and the biological bases of behavior, questions of the developmental curve for emotional phenomena and the relationship between feeling and thinking, and the study of social groups and culture. Readings and discussion attempt to integrate existent theory and research and apply their implications to the individual, the group, and society.",
    "tags": ["Psychology"]
  },
  "Adult Psychopathology": {
    "code": "Psychology 405",
    "description": "Introduces diagnosis and treatment of major mental disorders. Considers current thinking regarding the biological, psychological, and sociocultural factors that play contributing roles in the etiology and maintenance of these disorders. Historical trends as well as advances in neuroscience will be considered in terms of how they have affected our understanding of psychopathology.",
    "tags": ["Psychology"]
  },
  "Introduction to Human Factors": {
    "code": "Psychology 349",
    "description": "Conveys the importance of considering human capabilities and limits in system design and operation. This includes understanding human characteristics from the cognitive, physical, and psychosocial perspectives. Implications of these characteristics are explored through understanding the needs of people, designing to support these needs, and evaluating systems to ensure they serve the intended purpose. Case studies are used to identify the human role in accidents and to identify design improvements. Application domains include consumer product design, human-computer interaction, workplace safety, and complex systems such as healthcare delivery.",
    "tags": ["Psychology"]
  },
  "Child Development": {
    "code": "Psychology 460",
    "description": "Biological and behavioral foundations of human development, with an emphasis on experiments and data-driven approaches. Topics will include prenatal development, behavior genetics, motor development, perceptual development, language development, cognitive development, emotional development, social development, and atypical development.",
    "tags": ["Psychology"]
  },
  "Basic Statistics for Psychology": {
    "code": "Psychology 210",
    "description": "Measures of central tendency, variability; probability, sampling distributions; hypothesis testing, confidence intervals; t-tests; Chi-square; regression and correlation (linear) and introduction to analysis of variance (1-way).",
    "tags": ["Psychology"]
  },
  "Research Methods": {
    "code": "Psychology 225",
    "description": "General characteristics of scientific method; use of experimental, observational, and correlational research designs; research methods used in psychological science; illustration of core issues in research methods taken from several areas of psychology; lecture, demonstration, and experiments.",
    "tags": ["Psychology"]
  },
  "Data Science Programming II": {
    "code": "Computer Sciences 320",
    "description": "Intermediate approach to Data Science programming using Python. Experience with basic tabular analysis in Python is assumed. Learn to implement data structures (e.g., graphs) to efficiently represent datasets. Software-engineering tools such as version control and Python virtual environments will be introduced, with an emphasis on reproducibility of analysis. Tracing and A/B testing will be introduced as techniques for generating meaningful datasets. Introduces basic classification, clustering, optimization, and simulation techniques. Plotting and visual communication will be emphasized throughout the course.",
    "tags": ["Data Science"]
  },
  "Data Science Modeling II": {
    "code": "Statistics 340",
    "description": "Teaches how to explore, model, and analyze data using R. Topics include basic probability models; the central limit theorem; Monte Carlo simulation; one- and two-sample hypothesis testing; Bayesian inference; linear and logistic regression; ANOVA; the bootstrap; random forests and cross-validation. Features the analysis of real-world data sets and the communication of findings in a clear and reproducible manner within a project setting.",
    "tags": ["Data Science"]
  },
  "Data Science Modeling I": {
    "code": "Statistics 240",
    "description": "Introduces reproducible data management, modeling, analysis, and statistical inference through a practical, hands-on case studies approach. Topics include the use of an integrated statistical computing environment, data wrangling, the R programming language, data graphics and visualization, random variables and concepts of probability including the binomial and normal distributions, data modeling, statistical inference in one- and two- sample settings for proportions and means, simple linear regression, and report generation using R Markdown with applications to a wide variety of data to address open-ended questions.",
    "tags": ["Data Science"]
  },
  "Data and Algorithms: Ethics and Policy": {
    "code": "Library And Information Studies 461",
    "description": "An introduction to ethical, legal and policy issues related to analytics, \"big data\" and algorithms to support decision making. Gain familiarity with major debates and controversies in a variety of contexts. Critically analyze course materials and apply moral reasoning and legal concepts to assess case studies and critique arguments made by others.",
    "tags": ["Data Science", "Miscellaneous"]
  },
  "Introductory Biology": {
    "code": "Zoology 151",
    "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
    "tags": ["Psychology", "Miscellaneous"]
  },
  "Topics in Literature and Film": {
    "code": "English 176",
    "description": "An introduction to the interplay of literature and film in English, with a focus on the analysis of novels, stories, poems and other writings and their representation and transformation in and through film; specific topics will vary.",
    "tags": ["Miscellaneous"]
  },
  "Topics in Slavic Literatures in Translation": {
    "code": "Literature In Translation 247",
    "description": "Exploration of periods, genres, individual writers, themes, problems, ect. in Russian and Eastern European literature.",
    "tags": ["Miscellaneous"]
  },
  "Introduction to American Indian Studies": {
    "code": "American Indian Studies 100",
    "description": "Focus is history, social organization, political experience, artistic expression of North American Indians, using methods and materials from a number of disciplines as an introduction to the interdisciplinary field.",
    "tags": ["Miscellaneous"]
  },
  "Introduction to Philosophy": {
    "code": "Philosophy 101",
    "description": "Introduction to various philosophical questions and to the strategies that philosophers use to address these.",
    "tags": ["Miscellaneous"]
  }
}
